ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/AccumulationRegisters/ВКМ_ЗапланированныеОтпуска/ВКМ_ЗапланированныеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ЗапланированныеОтпуска</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КалендарныхДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConfigurationFonecmidDiplomTuzeka/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_КалендарьРабочихДней</schedule>
  <scheduleValue>InformationRegister.ВКМ_КалендарьРабочихДней.Resource.ВКМ_Коэффициент</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_КалендарьРабочихДней.Dimension.ВКМ_Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ВКМ_ПерерасчетОсновныхНачислений</name>
  </recalculations>
</mdclass:CalculationRegister>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ЗапланированныеОтпуска.Записывать = Истина;

	КалендарныхДнейПоСотрудникам = Новый Соответствие;

	ПарыСотрудникМесяц = Новый ТаблицаЗначений;
	ПарыСотрудникМесяц.Колонки.Добавить("Сотрудник");
	ПарыСотрудникМесяц.Колонки.Добавить("Месяц");

	Для Каждого СтрокаОтпуска Из ВКМ_ОтпускаСотрудников Цикл

		КоличествоДней = ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоКалендарныхДней(
			СтрокаОтпуска.ВКМ_ДатаНачала, СтрокаОтпуска.ВКМ_ДатаОкончания);

		Если КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] = Неопределено Тогда
			КалендарныхДнейПоСотрудникам.Вставить(СтрокаОтпуска.ВКМ_Сотрудник, КоличествоДней);
		Иначе
			КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] =
				КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] + КоличествоДней;
		КонецЕсли;

		ТекущийМесяц = НачалоМесяца(СтрокаОтпуска.ВКМ_ДатаНачала);
		ПоследнийМесяц = НачалоМесяца(СтрокаОтпуска.ВКМ_ДатаОкончания);
		Пока ТекущийМесяц <= ПоследнийМесяц Цикл
			НоваяПара = ПарыСотрудникМесяц.Добавить();
			НоваяПара.Сотрудник = СтрокаОтпуска.ВКМ_Сотрудник;
			НоваяПара.Месяц = ТекущийМесяц;
			ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		КонецЦикла;

	КонецЦикла;

	ЗарегистрироватьПерерасчетПриНеобходимости(ПарыСотрудникМесяц);

	Для Каждого ЭлементСотрудника Из КалендарныхДнейПоСотрудникам Цикл

		Движение = Движения.ВКМ_ЗапланированныеОтпуска.Добавить();
		Движение.Период = Дата(ВКМ_Год, 1, 1);
		Движение.ВКМ_Сотрудник = ЭлементСотрудника.Ключ;
		Движение.ВКМ_Год = ВКМ_Год;
		Движение.ВКМ_КалендарныхДней = ЭлементСотрудника.Значение;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьПерерасчетПриНеобходимости(ПарыСотрудникМесяц)

	Если ПарыСотрудникМесяц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеНачисления.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ПарыСотрудникМесяц КАК Пары
	|		ПО ОсновныеНачисления.ВКМ_Сотрудник = Пары.Сотрудник
	|			И ОсновныеНачисления.ПериодРегистрации = Пары.Месяц";
	Запрос.УстановитьПараметр("ПарыСотрудникМесяц", ПарыСотрудникМесяц);

	ВыборкаРегистраторов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРегистраторов.Следующий() Цикл

		НаборЗаписей = РегистрыРасчета.ВКМ_ОсновныеНачисления.Перерасчеты.ВКМ_ПерерасчетОсновныхНачислений
			.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектПерерасчета.Значение = ВыборкаРегистраторов.Регистратор;
		НаборЗаписей.Отбор.ОбъектПерерасчета.Использование = Истина;
		НаборЗаписей.Прочитать();

		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ОбъектПерерасчета = ВыборкаРегистраторов.Регистратор;
			НаборЗаписей.Записать();
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
